comp-sci/lisp/machine/i/datatypes.org
#+TITLE: Data Types - I-Machine
#+AUTHOR: Alex Nelson
#+EMAIL: pqnelson@gmail.com
#+DATE: <2021-02-24T17:06:08-08:00>
#+LANGUAGE: en
#+OPTIONS: H:5
#+HTML_DOCTYPE: html5
#+INCLUDE: ../../../../org-macros.org
#+HTML_LINK_UP: ./index.html
#+HTML_LINK_HOME: ../../../../index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../../../../css/stylesheet.css" />
# Created Wednesday February 24, 2021 at  5:06PM

* Lisp-Machine Data Types
** Introduction to Lisp-Machine Objects
*** Memory Words
**** Length and Format
**** Fields

*** Classes of Stored Object Representations
# 1.1.2

An object can be stored:
1. as a list, which is built out of one or more conses (e.g., conses, compact lists, closures, big ratios,
   double-precision floating point numbers, complex numbers, generic functions),
2. as an immediate object, which does not require any additional memory
   for its representation (e.g., numbers, physical addresses, primitive
   types, instructions), or
3. as a structure, represented as a block of memory words, the first
   contains a header with a special data type code (e.g., compiled functions, instances, arrays, symbols,
   bignums).

Each word within the structure object may contain:
- an object reference,
- a header
- a forwarding pointer, or
- a special marker.

*** Components of Stored Representations (1.1.3)

The components of stored representations found in Lisp Machine memory
are:
- object references,
- headers,
- forwarding (invisible) pointers, or
- special markers.

**** Object References (1.1.3.1)

Object references are the mechanism by which one refers to an object.
There are three types of object references:
1. object references /by address/ (implemented by a memory word whose
   address field contains the virtual address of the stored
   representation of the object; e.g., symbols, lists, arrays)
2. /immediate/ object references (implemented by memory words that
   directly contain the entire representation of the object; e.g., small
   integers, single-precision floating point numbers)
3. /pointers/ (contain the virtual addresses of locations that do not
   contain objects: they point to locations /within/ objects; e.g.,
   pointer to the value cell of a symbol).


**** Headers

Headers separate objects in memory. This contains information about the
type of object. There are two types of headers:
- ~dtp-header-i~ when the header is immediate data
- ~dtp-header-p~ when the header is the address containing some
  descriptive data

*** Operand-Reference Classification
# 1.1.4

Page 26 of the PDF

** Data-Type Descriptions
# 1.2

*** Representations of Symbols
# 1.2.1

The object reference to a symbol is a word of data type ~dtp-symbol~
or ~dtp-nil~.

*** Representation of Instances and Related Data Types
# 1.2.2

**** Flavor Instances
# 1.2.2.1

The object reference to an instance is a word of data type ~dtp-instance~
whose address field points to the instance structure.

**** List Instance
# 1.2.2.2
**** Array Instance
# 1.2.2.3
**** String Instance
*** Representation of Characters
# 1.2.3
*** Representation of Numbers
# 1.2.4
**** Fixnum Representation
**** Bignum Representation
# 1.2.4.2
**** Small-Ratio Representation
# 1.2.4.3
**** Big-Ratio Representation
# 1.2.4.4
**** Single-Precision Floating-Point Representation
# 1.2.4.5
**** Double-Precision Floating-Point Representation
# 1.2.4.6
**** Complex-Number Representation
# 1.2.4.7
**** The Spare-Number Type
# 1.2.4.8
*** Representations of Lists
# 1.2.5
*** Representations of Arrays and Strings
# 1.2.6
*** I-Machine Array Registers
*** Representations of Functions and Closures
**** Representation of Compiled Functions
**** Generic Functions
**** Representation of Lexical Closures
**** Representation of Dynamic Closures
*** Instruction Representation
# 1.2.9
*** Program-Counter Representation
# 1.2.10
The program counter (pc) is a register in the I-machine that contains
the virtual address of the currently executing instruction.
*** Representation of Locatives
# 1.2.11
A locative is a pointer to virtual memory implemented as an object with
data type ~dtp-locative~ and an address field that is the address of the
virtual memory word to which it points.

It is classified as a /pointer/ object reference.

Locatives may point to locations /within/ objects, such as the value
cell of a symbol. Other uses include the pointer to the start of data in
long format arrays and the base address of array registers.

** Data-Type Code Assignments
# 1.3
*** Headers, Special Markers, and Forwarding Pointers
*** Number Data Types
*** Instance Data Types
*** Primitive Data Types

There are 11 primitive types:

1. ~dtp-nil~ the symbol =NIL=
2. ~dtp-list~ a cons
3. ~dtp-array~ an array that is not a string
4. ~dtp-symbol~ a symbol other than =NIL=
5. ~dtp-locative~ locative pointer
6. ~dtp-lexical-closure~ a lexical closure of a function
7. ~dtp-dynamic-closure~ a dynamic closure of a function
8. ~dtp-generic-function~ a generic function
9. ~dtp-spare-pointer-1~
10. ~dtp-spare-pointer-2~
11. ~dtp-physical-address~ a physical address
12. ~dtp-spare-immediate-1~ a spare immediate
13. ~dtp-spare-pointer-3~
14. ~dtp-character~ a common list character object
15. ~dtp-spare-pointer-4~

*** Special Marker for Garbage Collector

*** Data Types for Program Counter Values

*** Full Word Instruction Data Types

*** Half-Word Instruction Data Types

** Appendix: Comparison of 3600-Family and I-Machine Data Representations

*** Array Differences

*** Compiled Function Differences

* Memory Layout and Addressing

# pg 77

** Address Space

*** Virtual Addresses

*** Ephemeral Addresses

*** Unmapped Addresses

*** Wired Addresses

*** Pages

** GC Support

** Address Translation

*** Page Hash Table

*** PHT Lookup Algorithm

*** Translation Algorithm

** Appendix: Comparison of 3600-Family and I-Machine Memory Layout and Addressing
